<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class HealthStatusSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $health_statuses = [
            ['name' => 'Very stable อาการคงที่ดีมาก', 'description' => 'บุคคลที่มีสุขภาพสภาวะของโรคคงที่ดี โรคประจำตัวได้ควบคุมได้ดี ไม่มีความผันผวน ไม่ได้ต้องการการติดตามอาการที่บ่อยนัก การรักษาเน้นการติดตามควบคุมสภาวะและรักษาในเชิงป้องกัน'],
            ['name' => 'Stable อาการคงที่', 'description' => 'ผู้ที่มีสุขภาพร่างกายแข็งแรงย่อมมีโรคประจำตัวซึ่งโดยทั่วไปได้รับการควบคุมอย่างดี อาจมีอาการผันผวนหรือแกว่งบ้างต้องคอยติดตาม เฝ้าระวัง ทั่วไปเนื่องจากมีความเสี่ยงแต่ไม่มาก การดูแลจากแพทย์อย่างสม่ำเสมอและปฏิบัติตามแผนการรักษา การรักษาเน้นการติดตามื ควบคุมติดตามโรคและรักษาในเชิงป้องกัน'],
            ['name' => 'Moderate Stable อาการคงที่ปานกลาง', 'description' => 'บุคคลที่มีสุขภาพค่อนข้างคงที่ จะมีโรคประจำตัวหรือสภาวะที่ต้องได้รับการดูแลอย่างต่อเนื่องและเฝ้าระวัง พวกเขาอาจมีอาการกำเริบหรือถอยหลังเป็นครั้งคราว เช่น ระดับน้ำตาลในเลือดสูง อาการสับสนเป็นครั้งคราว อาการถ่ายเหลว มีไข้ แต่โดยทั่วไปสามารถจัดการได้ด้วยการรักษาทางการแพทย์ ต้องได้รับการติดตามและรักษาเป็นระยะ'],
            ['name' => 'Unstable อาการไม่คงที่', 'description' => 'บุคคลที่มีสุขภาพไม่แน่นอนมากจะมีโรคหรือสภาวะพื้นฐานที่รุนแรงและควบคุมได้ไม่ดี เช่น อาการความรู้สึกตัวเปลี่ยนแปลงสับสนเฉียบพลัน ซึมลงบ้าง หายใจเร็ว เหนื่อยมากขึ้น มีไข้และสงสัย sepsis ต้องได้รับการเฝ้าระวังเป็นพิเศษ และพิจารณานำส่งโรงพยาบาล'],
            ['name' => 'Critically ill อาการวิกฤติ', 'description' => 'สถานะสุขภาพของพวกเขามีลักษณะมีความรุนแรงและเข้าขั้นวิกฤติ เช่น อาการสัญญาณชีพไม่คงที่ มีปัญหาเรื่องการหอบเหนื่อยมาก หรือ การทำงานของหัวใจล้มเหลว มีภาวะฉุกเฉินต่างๆ เช่น  อุบัติเหตุศีรษะกระแทกและหมดสติ การรู้สึกตัวเปลี่ยนแปลงไปมากโคม่า ต้องได้รับการรายงานและรักษาด้วยแพทย์เนื่องจากมีความเสี่ยงสูงต่อเหตุการณ์ที่คุกคามถึงชีวิต'],
        ];
        DB::table('health_statuses')->insert($health_statuses);
    }
}
